app/Http/Livewire/Client/Create.php

insert into "clients" ("client_name", "company_name", "main_contact_number", "email", "texti_fyi_number_id", "default_message", "default_request_message", "default_zipcode_message", "email_address_response", "default_messages_module", "default_message_notification", "default_message_response", "publish_keywords_module", "leads_module", "keyword_module", "mls_listing_module", "mls_agent_notification", "tips_request_module", "zip_code_module", "default_zip_notification", "email_address_module", "default_email_notification", "team_id", "updated_at", "created_at") values ('Adrienne Bradford', 'Stericycyle Corp.', '2813231390', 'profesone@gmail.com', '', '', '', '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, '2024-09-24 00:33:45', '2024-09-24 00:33:45')
---
    public function submit()
    {
        $this->validate();

        $this->client->save();