app/Http/Livewire/Client/Edit.php

select "id" from "textifyi_numbers" where "textifyi_numbers"."id" is null and "textifyi_numbers"."deleted_at" is null
---
    public function mount(Client $client)
    {
        $this->client = $client;
        $this->texti_fyi_number = $this->client->textiFyiNumber()->pluck('id')->toArray();

select "textifyi_numbers", "id" from "textifyi_numbers" where "textifyi_numbers"."deleted_at" is null
select "name", "id" from "teams" where "teams"."deleted_at" is null
---
    protected function initListsForFields(): void
    {
        $this->listsForFields['texti_fyi_number'] = (Auth::user()->getIsAdminAttribute())
        ? TextifyiNumber::whereNull('agency_id')->pluck('textifyi_numbers', 'id')->toArray()
        : TextifyiNumber::where('agency_id', '=', Auth::user()->team_id)->pluck('textifyi_numbers', 'id')->toArray();

        $this->listsForFields['team'] = Team::pluck('name', 'id')->toArray();