app/Http/Livewire/Client/GlobalView.php

    public function mount(Client $client)
    {
        $this->client = $client;
        // Set Client's team if not set previously
        if (auth()->user()->team_id){
            User::where('id', $this->client->id)
                ->update(['team_id' => auth()->user()->team_id]);
        }
        $this->edited = '';
        $this->newKeyword = '';
        $this->responses = TextResponse::where('client_id', $this->client->id)
            ->where('team_id', $this->teamId)
            ->orderBy('created_at', 'asc')
            ->get();
---
select * from "text_responses" where "client_id" = 1 and "team_id" is null and "text_responses"."deleted_at" is null order by "created_at" asc