app/Http/Livewire/Client/Index.php

    public function render()
    {
        $query = Client::with(['textiFyiNumber', 'team'])->advancedFilter([
            's'               => $this->search ?: null,
            'order_column'    => $this->sortBy,
            'order_direction' => $this->sortDirection,
        ]);

        $clients = $query->paginate($this->perPage);
---
select * from "teams" where "teams"."id" in (1) and "teams"."deleted_at" is null
select count(*) as aggregate from "clients" where "clients"."deleted_at" is null