app/Http/Livewire/Team/MyTeamForm.php

    public function createTeam()
    {
        if ($this->user->has_team) {
            return;
        }

        $this->resetErrorBag();
        $validated = $this->validateOnly('name');

        $this->user->ownedTeam()->create([
            'name'     => $validated['name'],
            'owner_id' => $this->user->id,
        ]);

        // Update user
        $team = Team::firstWhere('owner_id', auth()->id());
        User::where('id', auth()->id())
            ->update(['team_id' => $team->id]);
---
insert into "teams" ("name", "owner_id", "updated_at", "created_at") values ('Brun Warriors', 1, '2024-09-23 22:32:41', '2024-09-23 22:32:41')
select * from "teams" where "owner_id" = 1 and "teams"."deleted_at" is null limit 1
update "users" set "team_id" = 1, "updated_at" = '2024-09-23 22:32:41' where "id" = 1 and "users"."deleted_at" is null