app/Http/Livewire/TextifyiNumber/Create.php

    public function submit()
    {
        $this->validate();

        $this->textifyiNumber->save();
---
insert into "textifyi_numbers" ("textifyi_numbers", "team_id", "updated_at", "created_at") values ('2811234567', '', '2024-09-23 22:32:13', '2024-09-23 22:32:13')