app/Http/Livewire/TextifyiNumber/Index.php

    public function render()
    {
        $query = TextifyiNumber::advancedFilter([
            's'               => $this->search ?: null,
            'order_column'    => $this->sortBy,
            'order_direction' => $this->sortDirection,
        ]);

        $textifyiNumbers = $query->paginate($this->perPage);
---
select "textifyi_numbers".* from "textifyi_numbers" where "textifyi_numbers"."deleted_at" is null order by "textifyi_numbers" desc limit 100 offset 0
select count(*) as aggregate from "textifyi_numbers" where "textifyi_numbers"."deleted_at" is null