app/Http/Livewire/MyAgency.php

select * from "teams" where "teams"."id" is null and "teams"."deleted_at" is null limit 1
---
    public function mount()
    {
        $this->agency = Team::find(auth()->user()->team_id)->name;