app/Models/User.php

    public function getIsAdminAttribute()
    {
        return $this->roles()->where('title', 'Admin')->exists();
---
select exists(select * from "roles" inner join "role_user" on "roles"."id" = "role_user"."role_id" where "role_user"."user_id" = 1 and "title" = 'Admin' and "roles"."deleted_at" is null) as "exists"