app/Http/Controllers/Admin/ClientController.php

select * from "teams" where "teams"."id" in (1) and "teams"."deleted_at" is null
---
    public function show(Client $client)
    {
        abort_if(Gate::denies('client_show'), Response::HTTP_FORBIDDEN, '403 Forbidden');

        $client->load('textiFyiNumber', 'team');